/* Problem-01: New Price for Eid Sale
⚠️ Function Name Must be newPrice()
আসন্ন ইদ উপলক্ষে তুমি তোমার দোকানের প্রোডাক্টে ডিসকাউণ্ট দিতে চাচ্ছ। কিন্তু প্রতিটা প্রোডাক্টের নতুন দাম আলাদা আলাদা হিসাব করতে গেলে ঝামেলা। তাই তুমি একটা ফাংশন বানাতে চাও, যা মূল দাম এবং ডিসকাউন্ট% নিলে নতুন দাম বের করে দেবে।

Input :  
প্রথম ইনপুট:  একটি সংখ্যা যা মূল দাম। currentPrice  হবে Number 
দ্বিতীয় ইনপুট: একটি সংখ্যা যা ডিসকাউন্ট। discount হবে Number in  %




Output :   ফাংশনটি ডিসকাউন্ট করে নতুন দাম return করবে।  Output দশমিক সংখ্যা ও হতে পারে।  দশমিক এর পর ৩ ঘর  দেখাতে হবে।

 
Challenge 📢 : যদি কোনো ইনপুট সংখ্যা না হয় , অথবা discount এর পরিমান যদি 0  এর থেকে কম এবং 100 এর চেয়ে বেশি হয় তাহলে  Invalid স্ট্রিং  রিটার্ন করবে। 



Hints 💡:  যদি একটি প্রোডাক্টের currentPrice = 1500 টাকা এবং discount = 20% হয়, তাহলে:
ডিসকাউন্টের পরিমাণ বের করো, ডিসকাউন্ট পরিমাণ = (1500 * 20) / 100 = 300 টাকা


SAMPLE INPUT
SAMPLE OUTPUT
1500, 20
1200.000
2000, 15
1700.000
1200, 7
1116.000
"1000", 10
Invalid
2000, 17.17
1656.600
500, "5"
Invalid


/*function signature/sample 
function newPrice(currentPrice , discount ) {
          // You have to write your code here
}
*/

function newPrice(currentPrice, discount) {
  if (currentPrice <= 0 || typeof currentPrice !== 'number' || discount < 0 || discount > 100 || typeof discount !== 'number') {
    return 'Invalid';
  }
  const discountedPrice = (currentPrice * discount) / 100;
  const finalPrice = (currentPrice- discountedPrice).toFixed(3);
  
  return finalPrice;
}

const result = newPrice(1500, 20);
console.log(result);

